In [1]:
import pandas as pd
import numpy as np

# Table of contents
1. [Importing data](#Importing-data)
2. [Cleaning data](#Cleaning-data)
    1. [Cleaning date times](#Cleaning-date-times)
        1. [Month column](#Month-column)
        2. [Date column](#Date-column)
    2. [Cleaning state column](#Cleaning-state-column)
        1. [Duplicates](#Duplicates)
        2. [Mato Grosso and Paraiba](#Mato-Grosso-and-Paraiba)
        3. [Rio states](#Rio-states)
        4. [Assign state codes](#Assign-state-codes)

# Importing data

In [2]:
df = pd.read_csv('data/amazon.csv', encoding='ansi')

In [3]:
df.sample(5)

      year        state     month  number        date
655   2014        Amapa  Setembro   137.0  2014-01-01
4974  2011          Rio   Outubro    74.0  2011-01-01
5071  2009     Rondonia     Março    12.0  2009-01-01
2763  2011  Mato Grosso     Julho   250.0  2011-01-01
3669  2001      Paraiba      Maio    26.0  2001-01-01

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

# Cleaning data

## Cleaning date times

### Month column

The month column contains month in Portugese. It will be easier if the column is converted to numerical value

In [5]:
months_in_portugese = {'Janeiro':1, 'Fevereiro':2, 'Março':3, 
                      'Abril':4, 'Maio':5, 'Junho':6,
                      'Julho':7, 'Agosto':8, 'Setembro':9,
                      'Outubro':10, 'Novembro':11, 'Dezembro':12}

In [6]:
df['month'] = df['month'].map(months_in_portugese)

In [7]:
df.sample(5)

      year             state  month  number        date
1760  2004    Espirito Santo      5     0.0  2004-01-01
1505  2008  Distrito Federal      4     1.0  2008-01-01
4536  2011               Rio     12     3.0  2011-01-01
4093  2007              Piau      2    11.0  2007-01-01
5062  2000          Rondonia      3     9.0  2000-01-01

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   int64
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(2), object(2)
memory usage: 252.2+ KB

### Date column

In [9]:
df['date'] = pd.to_datetime(df['date'])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   int64
 3   number  6454 non-null   float64
 4   date    6454 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 252.2+ KB

## Cleaning state column

### Duplicates

There are multiple issues with state column due to bad data entry. 

* There are three 'Rio' states - Rio de Janeiro, Rio Grande do Norte, Rio Grande do Sul. The data has entries for all three, but only has 'Rio' label
* There are Mato Grosso and Mato Grosso do Sul. The data labels Mato Grosso for entries from both state.
* Same things happen for Paraiba and Parana. Both entries from the state are labeled Paraiba

Reference to list of all Brazilian states - https://en.wikipedia.org/wiki/Federative_units_of_Brazil

In [11]:
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [12]:
df[df.duplicated(subset=['state','year','month'], keep=False)==True]

      year        state  month  number       date
258   2017      Alagoas      1    38.0 2017-01-01
259   2017      Alagoas      1    38.0 2017-01-01
2391  1998  Mato Grosso      1     0.0 1998-01-01
2392  1999  Mato Grosso      1    39.0 1999-01-01
2393  2000  Mato Grosso      1    44.0 2000-01-01
...    ...          ...    ...     ...        ...
5015  2012          Rio     12    38.0 2012-01-01
5016  2013          Rio     12    62.0 2013-01-01
5017  2014          Rio     12    31.0 2014-01-01
5018  2015          Rio     12    42.0 2015-01-01
5019  2016          Rio     12    79.0 2016-01-01

[1675 rows x 5 columns]

In [13]:
df[df.duplicated(subset=['state','year','month'], keep=False)==True]['state'].unique()

array(['Alagoas', 'Mato Grosso', 'Paraiba', 'Rio'], dtype=object)

There is one duplicate entry for Alagoas. Dropping one of the entry.

In [14]:
df.drop(258, inplace=True)

In [15]:
df.iloc[255:260]

     year    state  month  number       date
255  2014  Alagoas      1    54.0 2014-01-01
256  2015  Alagoas      1    81.0 2015-01-01
257  2016  Alagoas      1    24.0 2016-01-01
259  2017  Alagoas      1    38.0 2017-01-01
260  1998  Alagoas      2     0.0 1998-01-01

In [16]:
df.reset_index(inplace=True, drop=True)

In [17]:
df.iloc[255:260]

     year    state  month  number       date
255  2014  Alagoas      1    54.0 2014-01-01
256  2015  Alagoas      1    81.0 2015-01-01
257  2016  Alagoas      1    24.0 2016-01-01
258  2017  Alagoas      1    38.0 2017-01-01
259  1998  Alagoas      2     0.0 1998-01-01

### Mato Grosso and Paraiba

Strategy -

* Take the lower half of duplicated Mato Grosso and Paraiba
* Rename it to there equivalent supposedly next alphabetic state (eg. Mato Grosso --> Mato Grosso do Sul, Paraiba --> Parana)

duplicate = same place (state), same time (year and month)

**Mato Grosso and Mato Grosso do Sul**

In [18]:
matto_grosso_de_sul_mask = df.duplicated(subset=['state','year','month'], keep='first') & (df['state']=='Mato Grosso')
df[matto_grosso_de_sul_mask]

      year        state  month  number       date
2629  1998  Mato Grosso      1     0.0 1998-01-01
2630  1999  Mato Grosso      1   239.0 1999-01-01
2631  2000  Mato Grosso      1   326.0 2000-01-01
2632  2001  Mato Grosso      1    97.0 2001-01-01
2633  2002  Mato Grosso      1   304.0 2002-01-01
...    ...          ...    ...     ...        ...
2863  2012  Mato Grosso     12   194.0 2012-01-01
2864  2013  Mato Grosso     12   195.0 2013-01-01
2865  2014  Mato Grosso     12    84.0 2014-01-01
2866  2015  Mato Grosso     12   394.0 2015-01-01
2867  2016  Mato Grosso     12   123.0 2016-01-01

[239 rows x 5 columns]

In [19]:
df.loc[matto_grosso_de_sul_mask, 'state'] = 'Mato Grosso do Sul'

In [20]:
df[matto_grosso_de_sul_mask].head()

      year               state  month  number       date
2629  1998  Mato Grosso do Sul      1     0.0 1998-01-01
2630  1999  Mato Grosso do Sul      1   239.0 1999-01-01
2631  2000  Mato Grosso do Sul      1   326.0 2000-01-01
2632  2001  Mato Grosso do Sul      1    97.0 2001-01-01
2633  2002  Mato Grosso do Sul      1   304.0 2002-01-01

In [21]:
df.iloc[2626:2632]

      year               state  month   number       date
2626  2014         Mato Grosso     12  466.000 2014-01-01
2627  2015         Mato Grosso     12    1.777 2015-01-01
2628  2016         Mato Grosso     12  425.000 2016-01-01
2629  1998  Mato Grosso do Sul      1    0.000 1998-01-01
2630  1999  Mato Grosso do Sul      1  239.000 1999-01-01
2631  2000  Mato Grosso do Sul      1  326.000 2000-01-01

**Paraiba and Parana**

In [22]:
parana_mask = df.duplicated(subset=['state','year','month'], keep='first') & (df['state']=='Paraiba')
df[parana_mask]

      year    state  month  number       date
3585  1998  Paraiba      1     0.0 1998-01-01
3586  1999  Paraiba      1     7.0 1999-01-01
3587  2000  Paraiba      1    49.0 2000-01-01
3588  2001  Paraiba      1    32.0 2001-01-01
3589  2002  Paraiba      1    47.0 2002-01-01
...    ...      ...    ...     ...        ...
3819  2012  Paraiba     12    54.0 2012-01-01
3820  2013  Paraiba     12   155.0 2013-01-01
3821  2014  Paraiba     12    78.0 2014-01-01
3822  2015  Paraiba     12    30.0 2015-01-01
3823  2016  Paraiba     12    45.0 2016-01-01

[239 rows x 5 columns]

In [23]:
df.loc[parana_mask, 'state'] = 'Parana'

In [24]:
df[parana_mask].head()

      year   state  month  number       date
3585  1998  Parana      1     0.0 1998-01-01
3586  1999  Parana      1     7.0 1999-01-01
3587  2000  Parana      1    49.0 2000-01-01
3588  2001  Parana      1    32.0 2001-01-01
3589  2002  Parana      1    47.0 2002-01-01

In [25]:
df.iloc[3582:3587]

      year    state  month  number       date
3582  2014  Paraiba     12    62.0 2014-01-01
3583  2015  Paraiba     12   122.0 2015-01-01
3584  2016  Paraiba     12     8.0 2016-01-01
3585  1998   Parana      1     0.0 1998-01-01
3586  1999   Parana      1     7.0 1999-01-01

**Check to make sure**

In [26]:
df['state'].value_counts()[['Parana','Paraiba','Mato Grosso','Mato Grosso do Sul']]

Parana                239
Paraiba               239
Mato Grosso           239
Mato Grosso do Sul    239
Name: state, dtype: int64

### Rio states

Strategy -

* Rename all 'Rio' state to 'Rio de Janeiro'
* Take the lower two third of duplicated 'Rio de Janeiro', rename it to 'Rio Grande do Norte'
* After renaming, take the lower half of duplicated 'Rio Grande do Norte', rename it to 'Rio Grande do Sul'

In [27]:
df.loc[df['state'] == 'Rio', 'state'] = 'Rio de Janeiro'

In [28]:
rio_grande_norte_mask = df.duplicated(subset=['state','year','month'], keep='first') & (df['state']=='Rio de Janeiro')
df[rio_grande_norte_mask]

      year           state  month  number       date
4541  1998  Rio de Janeiro      1     0.0 1998-01-01
4542  1999  Rio de Janeiro      1    32.0 1999-01-01
4543  2000  Rio de Janeiro      1     1.0 2000-01-01
4544  2001  Rio de Janeiro      1     2.0 2001-01-01
4545  2002  Rio de Janeiro      1     4.0 2002-01-01
...    ...             ...    ...     ...        ...
5014  2012  Rio de Janeiro     12    38.0 2012-01-01
5015  2013  Rio de Janeiro     12    62.0 2013-01-01
5016  2014  Rio de Janeiro     12    31.0 2014-01-01
5017  2015  Rio de Janeiro     12    42.0 2015-01-01
5018  2016  Rio de Janeiro     12    79.0 2016-01-01

[478 rows x 5 columns]

In [29]:
df.loc[rio_grande_norte_mask, 'state'] = 'Rio Grande do Norte'

In [30]:
rio_grande_sul_mask = df.duplicated(subset=['state','year','month'], keep='first') & (df['state']=='Rio Grande do Norte')
df[rio_grande_sul_mask]

      year                state  month  number       date
4780  1998  Rio Grande do Norte      1     0.0 1998-01-01
4781  1999  Rio Grande do Norte      1    63.0 1999-01-01
4782  2000  Rio Grande do Norte      1   126.0 2000-01-01
4783  2001  Rio Grande do Norte      1    12.0 2001-01-01
4784  2002  Rio Grande do Norte      1   265.0 2002-01-01
...    ...                  ...    ...     ...        ...
5014  2012  Rio Grande do Norte     12    38.0 2012-01-01
5015  2013  Rio Grande do Norte     12    62.0 2013-01-01
5016  2014  Rio Grande do Norte     12    31.0 2014-01-01
5017  2015  Rio Grande do Norte     12    42.0 2015-01-01
5018  2016  Rio Grande do Norte     12    79.0 2016-01-01

[239 rows x 5 columns]

In [31]:
df.loc[rio_grande_sul_mask, 'state'] = 'Rio Grande do Sul'

**Check to make sure**

In [32]:
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Mato Grosso do Sul', 'Minas Gerais', 'Pará',
       'Paraiba', 'Parana', 'Pernambuco', 'Piau', 'Rio de Janeiro',
       'Rio Grande do Norte', 'Rio Grande do Sul', 'Rondonia', 'Roraima',
       'Santa Catarina', 'Sao Paulo', 'Sergipe', 'Tocantins'],
      dtype=object)

In [33]:
df['state'].value_counts()[['Rio de Janeiro',
       'Rio Grande do Norte', 'Rio Grande do Sul']]

Rio de Janeiro         239
Rio Grande do Norte    239
Rio Grande do Sul      239
Name: state, dtype: int64

In [34]:
(df['state'] == 'Rio').any()

False

### Assign state codes

In [35]:
df_states = pd.read_csv('data/states.csv')
df_states.head()

,name,code,capital,largest city,area_km2,population,density_perkm2,gdp_r$million,hdi
0,Acre,AC,Rio Branco,Rio Branco,164124,881935,5.37,13751,0.719
1,Alagoas,AL,Maceió,Maceió,27843,3337357,119.86,49456,0.683
2,Amapá,AP,Macapá,Macapá,142471,845731,5.94,14339,0.740
3,Amazonas,AM,Manaus,Manaus,1559168,4144597,2.66,89017,0.733
4,Bahia,BA,Salvador,Salvador,564723,14873064,26.34,258649,0.714

In [36]:
cols = df_states.select_dtypes(include=[np.object]).columns
df_states[cols] = df_states[cols].apply(lambda x: x.str.normalize('NFKD').str.encode('ascii', errors='ignore').str.decode('utf-8'))
df_states.head()

,name,code,capital,largest city,area_km2,population,density_perkm2,gdp_r$million,hdi
0,Acre,AC,Rio Branco,Rio Branco,164124,881935,5.37,13751,0.719
1,Alagoas,AL,Maceio,Maceio,27843,3337357,119.86,49456,0.683
2,Amapa,AP,Macapa,Macapa,142471,845731,5.94,14339,0.740
3,Amazonas,AM,Manaus,Manaus,1559168,4144597,2.66,89017,0.733
4,Bahia,BA,Salvador,Salvador,564723,14873064,26.34,258649,0.714

In [37]:
state_code_map = df_states[['name','code']]
state_code_map.head()

       name code
0      Acre   AC
1   Alagoas   AL
2     Amapa   AP
3  Amazonas   AM
4     Bahia   BA

In [38]:
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Mato Grosso do Sul', 'Minas Gerais', 'Pará',
       'Paraiba', 'Parana', 'Pernambuco', 'Piau', 'Rio de Janeiro',
       'Rio Grande do Norte', 'Rio Grande do Sul', 'Rondonia', 'Roraima',
       'Santa Catarina', 'Sao Paulo', 'Sergipe', 'Tocantins'],
      dtype=object)

In [39]:
df_states['name'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Mato Grosso do Sul', 'Minas Gerais', 'Para',
       'Paraiba', 'Parana', 'Pernambuco', 'Piaui', 'Rio de Janeiro',
       'Rio Grande do Norte', 'Rio Grande do Sul', 'Rondonia', 'Roraima',
       'Santa Catarina', 'Sao Paulo', 'Sergipe', 'Tocantins'],
      dtype=object)

In [41]:
df.loc[df['state']=='Pará', 'state'] = 'Para'
df.loc[df['state']=='Piau', 'state'] = 'Piaui'

In [42]:
df = df.merge(state_code_map, left_on='state', right_on='name').drop(columns=['name']).rename(columns={'code':'state_code'})

In [43]:
df.sample(5)

      year         state  month   number       date state_code
3018  2008  Minas Gerais      8  605.000 2008-01-01         MG
5904  2006     Sao Paulo      9  694.000 2006-01-01         SP
440   1999       Alagoas     11   15.000 1999-01-01         AL
2562  2010   Mato Grosso      9   18.366 2010-01-01         MT
132   2010          Acre      7  126.000 2010-01-01         AC

In [44]:
df['state_code'].unique()

array(['AC', 'AL', 'AP', 'AM', 'BA', 'CE', 'DF', 'ES', 'GO', 'MA', 'MT',
       'MS', 'MG', 'PA', 'PB', 'PR', 'PE', 'PI', 'RJ', 'RN', 'RS', 'RO',
       'RR', 'SC', 'SP', 'SE', 'TO'], dtype=object)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6453 entries, 0 to 6452
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        6453 non-null   int64
 1   state       6453 non-null   object
 2   month       6453 non-null   int64
 3   number      6453 non-null   float64
 4   date        6453 non-null   datetime64[ns]
 5   state_code  6453 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 352.9+ KB